import React, { useCallback, useState } from 'react';

import styles from './policy.module.scss';

import Navbar from '../../components/layouts/navbar/navbar.component';
import Footer from '../../components/layouts/footer/footer.component';

import Header from '../../assets/images/airplane-windows.svg';
import { ReactComponent as Arrow2 } from '../../assets/icons/arrow-2.svg';

const Policy = () =>
{
    const [page, setPage] = useState('policy');
    const handlePage = useCallback(
        (page: string) =>
        {
            setPage(page);
        }, [setPage]);

    return (
        <main>
            <Navbar
                header='قوانین و مقررات'
                title='قوانین و مقررات'
                description='خط مشی های سایت'
                headerImage={Header}
            />
            <section className={styles.policyMain}>
                <div className='container border'>
                    <aside>
                        <button onClick={() => handlePage('policy') } data-activate={page === 'policy'}>
                            قوانین عمومی
                            <Arrow2 />
                        </button>
                        <button onClick={() => handlePage('reserve') } data-activate={page === 'reserve'}>
                            رزرو هتل
                            <Arrow2 />
                        </button>
                        <button onClick={() => handlePage('conditions') } data-activate={page === 'conditions'}>
                            شرایط استفاده
                            <Arrow2 />
                        </button>
                        <button onClick={() => handlePage('flight') } data-activate={page === 'flight'}>
                            پرواز
                            <Arrow2 />
                        </button>
                    </aside>
                    <article data-activate={page === 'policy'}>
                        <h2>
                            قوانین و مقررات عمومی
                        </h2>
                        <p>
                            برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. تست لینک بلیط یاب کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند . برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند
                        </p>
                        <ul>
                            <a href='#'>
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                شغل اصلی مردم شهر زیبای فشم
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                بهترین زمان سفر و تفریح
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                شکم گردی در رستوران های فشم
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                بهترین زمان سفر و تفریح
                                فشم چطور جایی است
                            </a>
                        </ul>
                        <h2>
                            سیاست حفظ حریم خصوصی کاربران
                        </h2>
                        <p>
                            برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. تست لینک بلیط یاب کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند . برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند
                        </p>
                    </article>
                    <article data-activate={page === 'reserve'}>
                        <h2>
                            رزرو هتل
                        </h2>
                        <p>
                            برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. تست لینک بلیط یاب کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند . برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند
                        </p>
                        <ul>
                            <a href='#'>
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                شغل اصلی مردم شهر زیبای فشم
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                بهترین زمان سفر و تفریح
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                شکم گردی در رستوران های فشم
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                بهترین زمان سفر و تفریح
                                فشم چطور جایی است
                            </a>
                        </ul>
                        <h2>
                            سیاست حفظ حریم خصوصی کاربران
                        </h2>
                        <p>
                            برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. تست لینک بلیط یاب کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند . برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند
                        </p>
                    </article>
                    <article data-activate={page === 'conditions'}>
                        <h2>
                            شرایط استفاده
                        </h2>
                        <p>
                            برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. تست لینک بلیط یاب کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند . برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند
                        </p>
                        <ul>
                            <a href='#'>
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                شغل اصلی مردم شهر زیبای فشم
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                بهترین زمان سفر و تفریح
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                شکم گردی در رستوران های فشم
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                بهترین زمان سفر و تفریح
                                فشم چطور جایی است
                            </a>
                        </ul>
                        <h2>
                            سیاست حفظ حریم خصوصی کاربران
                        </h2>
                        <p>
                            برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. تست لینک بلیط یاب کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند . برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند
                        </p>
                    </article>
                    <article data-activate={page === 'flight'}>
                        <h2>
                            پرواز
                        </h2>
                        <p>
                            برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. تست لینک بلیط یاب کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند . برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند
                        </p>
                        <ul>
                            <a href='#'>
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                شغل اصلی مردم شهر زیبای فشم
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                بهترین زمان سفر و تفریح
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                شکم گردی در رستوران های فشم
                                فشم چطور جایی است
                            </a>
                            <a href='#'>
                                بهترین زمان سفر و تفریح
                                فشم چطور جایی است
                            </a>
                        </ul>
                        <h2>
                            سیاست حفظ حریم خصوصی کاربران
                        </h2>
                        <p>
                            برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. تست لینک بلیط یاب کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند . برای تهران‌نشین‌ها، فشم صرفا یک روستای عادی نیست؛ فشم تهران برای ساکنین پایتخت یک راه قرار است، فرار از آلودگی و شلوغی شهر به دامان سرسبز و آرامش‌بخش طبیعت. کافی‌ست یکی از روزهای تعطیل بار مختصری بسته و راهی این روستا شوید. حتی قبل از اینکه جایی اتراق کنید، زیبایی‌های مسیر منظور مرا برایتان اثبات می‌کند
                        </p>
                    </article>
                </div>
            </section>
            <Footer />
        </main>
    );
};

export default Policy;
